In [2]:
import pandas as pd
import numpy as np

In [3]:
dictionary={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
weatherDataFrame = pd.DataFrame(dictionary)

In [10]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
weatherDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [12]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [13]:
weatherDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [16]:
newData={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
newDataDataFrame = pd.DataFrame(newData)

In [17]:
newDataDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [18]:
newDataDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [21]:
newDataDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [30]:
salaryDict = {"Department": ["Software","Software","Marketing","Marketing","Law","Law"],
              "Employeer Name":["Ahmet","Mehmet","Ali","Zeynep","Burcu","Birsen"],
             "Salary": [100,150,200,350,400,500]}

In [31]:
salaryDataFrame=pd.DataFrame(salaryDict)

In [32]:
salaryDataFrame

  Department Employeer Name  Salary
0   Software          Ahmet     100
1   Software         Mehmet     150
2  Marketing            Ali     200
3  Marketing         Zeynep     350
4        Law          Burcu     400
5        Law         Birsen     500

In [33]:
groupObject = salaryDataFrame.groupby("Department")

In [34]:
groupObject.count()

            Employeer Name  Salary
Department
Law                      2       2
Marketing                2       2
Software                 2       2

In [35]:
groupObject.mean()

            Salary
Department
Law            450
Marketing      275
Software       125